// ЗАДАЧА 1
// НАПИШІТЬ РЕЧЕННЯ ЗА ДОПОМОГОЮ ШАБЛОННОГО РЯДКА "ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ГАЛИНА, МЕНІ 35 РОКІВ, Я ВИВЧАЮ JAVASCRIPT"
//const name = "Галина";
//const age = 35;
//const hobbi = "Javascript";
//const message = `ДОБРОГО ДНЯ,МЕНЕ ЗВАТИ ${name}, МЕНІ ${age} РОКІВ, Я ВИВЧАЮ ${hobbi}`;
//console.log(message);


//ЗАДАЧА 2
//ЗАПИТАТИ У КОРИСТУВАЧА ІМЯ, ПОЧТУ, ТЕЛЕФОН, І ПОКАЗАТИ У КОНСОЛІ "КОРИСТУВАЧ __ ВИКОРИСТОВУЄ  __ ПОЧТУ І __ ТЕЛЕФОН"
// const names = prompt("Введіть своє ім'я");
// const post = prompt("Введіть вашу пошту");
// const telef = prompt("Введіть ваш телефонний номер");
// const message = `КОРИСТУВАЧ ${names} ВИКОРИСТОВУЄ  ${post} ПОЧТУ І ${telef} ТЕЛЕФОН`;
// console.log(message);

// ЗАДАЧА 3
// ПОТРІБНО ЗАПИТАТИ У МАГАЗИНІ ЦІНУ ЗА КОЖЕН ОКРЕМИЙ ТОВАР,ТА ВИВЕСТИ ПОВІДОМЛЕННЯМ   ЗАГАЛЬНУ ЦІНУ ТОВАРУ

/* const price1 = Number(prompt("Введіть ціну товару1"));
const price2 = +prompt("Введіть ціну товару2");
const price3 = +prompt("Введіть ціну товару3");
const totalPrice = price1 + price2 + price3;
console.log(totalPrice); */

/* ЗАДАЧА 4
ВИКОРИСТОВУЮЧИ КОНСТРУКЦІЮ IF...ELSE , НАПИШИ КОД, ЯКИЙ БУДЕ ЗАПИТУВАТИ: 
"СКІЛЬКИ МІСЯЦІВ МАЄ РІК", ЯКЩО КОРИСТУВАЧ ВВОДИТЬ 12 ТО У КОНСОЛІ ПИШЕ ВІРНО, ЯКЩО НЕ ПРАВИЛЬНО КОРИСТУВАЧ ВВІВ, ТОДІ У КОНСОЛІ ПИШЕ 
"НЕ ЗНАЄТЕ? 12" */

/* const year = 12;
let userMessage = Number(prompt("СКІЛЬКИ МІСЯЦІВ МАЄ РІК?"));
if (userMessage === year) {
    console.log("ВІРНО")
} else { console.log("НЕ ЗНАЄТЕ? 12");} */

// ЗАДАЧА 5
// НАПИШІТЬ ПРОГРАМУ, ЯКА ДОЗВОЛЯТИМЕ ЮЗЕРУ ВВОДИТИ ЧИСЛО І ВИЗНАЧАТИМЕ ЧИ ЦЕ ПАРНЕ ЧИСЛО , ЧИ НЕ ПАРНЕ.

// const number = prompt("Введіть число");
// // if (number % 2 === 0) {
// //     console.log("парне");
// // } else {console.log("непарне")};
//  const result = number % 2 === 0 ? "парне" : "непарне";
//  console.log(result);
